
def area(a):
    '''
    Возвращает площаль квадрата со стороной длины a

        Параметры:
            a (int или float): положительное число обозначающее длину стороны квадрата

        Возвращаемое значение:
            a * a (int или float): площадь квадрата со стороной длины a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной длины a

        Параметры:
            a (int или float): положительное число обозначающее длину стороны квадрата

        Возвращаемое значение:
            4 * a (int или float): периметр квадрата со стороной длины a
    '''
    return 4 * a
